Tekla Open API Reference for Tekla Structures 2025
RadiusDimension Constructor (ViewBase, Point, Point, Point, Double)
 Creates a new radius dimension instance using three points and the distance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RadiusDimension(
	ViewBase View,
	Point ArcPoint1,
	Point ArcPoint2,
	Point ArcPoint3,
	double Distance
)
Public Sub New (
	View As ViewBase,
	ArcPoint1 As Point,
	ArcPoint2 As Point,
	ArcPoint3 As Point,
	Distance As Double
)
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
ArcPoint1
Type: Tekla.Structures.Geometry3d.Point
The first arc point to be used.
ArcPoint2
Type: Tekla.Structures.Geometry3d.Point
The second arc point to be used.
ArcPoint3
Type: Tekla.Structures.Geometry3d.Point
The third arc point to be used.
Distance
Type: System.Double
The distance to be used.
See Also
Reference
RadiusDimension Class
RadiusDimension Overload
Tekla.Structures.Drawing Namespace